cf/DataProcessors/ПредставлениеКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПредставлениеКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПользовательЛичногоКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноРедактироватьТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/ПредставлениеКонтактнойИнформации/Ext/ObjectModule.bsl
#Если Клиент Тогда

// Процедура по заданным значениям реквизитов перезаполняет
// данными табличную часть
//
// Параметры
//  НЕТ
// Возвращаемые значения
//  НЕТ
Процедура ОбновитьТаблицу() Экспорт

	КонтактнаяИнформация.Очистить();
	Если ОбъектКонтактнойИнформации = Неопределено ИЛИ ОбъектКонтактнойИнформации.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос();

	Запрос.УстановитьПараметр("Объект"                        , ОбъектКонтактнойИнформации);
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъектаКонтактнойИнформации);
	Запрос.УстановитьПараметр("ПустаяСтрока"                  , "");
	Запрос.УстановитьПараметр("ТекущаяДата"                   , ТекущаяДата());

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|
	|	КонтактнаяИнформация.Объект КАК Объект,
	|
	|	ВЫБОР КОГДА
	|		КонтактнаяИнформация.ЗначениеПоУмолчанию ЕСТЬ NULL
	|	ТОГДА
	|		ЛОЖЬ
	|	ИНАЧЕ
	|		КонтактнаяИнформация.ЗначениеПоУмолчанию
	|	КОНЕЦ КАК ЗначениеПоУмолчанию,
	|
	|	ВидыКонтактнойИнформации.Тип    КАК Тип,
	|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|
	|	ВЫБОР КОГДА
	|		НЕ КонтактнаяИнформация.Объект ЕСТЬ NULL
	|	ТОГДА
	|		КонтактнаяИнформация.Представление
	|	ИНАЧЕ
	|		&ПустаяСтрока
	|	КОНЕЦ КАК Представление,
	|
	|	ВЫБОР КОГДА
	|		НЕ КонтактнаяИнформация.Объект ЕСТЬ NULL
	|	ТОГДА
	|		КонтактнаяИнформация.Комментарий
	|	ИНАЧЕ
	|		&ПустаяСтрока
	|	КОНЕЦ  КАК Комментарий
	|	
	|ИЗ
	|
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|	ПО
	|		ВидыКонтактнойИнформации.Ссылка = КонтактнаяИнформация.Вид
	|		И
	|		КонтактнаяИнформация.Объект = &Объект
	|ГДЕ
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Комментарий
	|	
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|	
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И
	|	НЕ КонтактнаяИнформация.Вид ССЫЛКА Справочник.ВидыКонтактнойИнформации
	|";

	КонтактнаяИнформация.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Процедура обрабатывает действие начала редактирования или ввода новой
// записи контактной информации
//
// Параметры
//  ВыбОбъект - объект уже существующей записи в регистре контактной информации
//  ВыбТип - тип уже существующей или новой записи в регистре контактной информации
//  ВыбВид - вид уже существующей или новой записи в регистре контактной информации
//  ТекущийОбъект - Объект новой записи в регистре контактной информации
//  ФормаВладелец - форма из которой произошел вызов процедуры
// Возвращаемые значения
//  НЕТ
Процедура РедактироватьЗапись(ВыбОбъект, ВыбТип, ВыбВид, ТекущийОбъект, ФормаВладелец, Копирование = Ложь) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();

	Если НЕ ЗначениеЗаполнено(ВыбОбъект) Тогда
		// Выбрали запись, которой еще нет в регистре

		МенеджерЗаписи.Объект = ТекущийОбъект;
		МенеджерЗаписи.Тип    = ВыбТип;
		МенеджерЗаписи.Вид    = ВыбВид;
		
		Если Копирование Тогда

			НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Значение      = ТекущийОбъект;
			НаборЗаписей.Отбор.Объект.Использование = Истина;
			НаборЗаписей.Отбор.Тип.Значение         = ВыбТип;
			НаборЗаписей.Отбор.Тип.Использование    = Истина;
			НаборЗаписей.Отбор.Вид.Значение         = ВыбВид;
			НаборЗаписей.Отбор.Вид.Использование    = Истина;
			
			НаборЗаписей.Прочитать();
			
			ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();

			Если ТаблицаНабораЗаписей.Количество() > 0 Тогда
				Для каждого Колонка Из ТаблицаНабораЗаписей.Колонки Цикл
					МенеджерЗаписи[Колонка.Имя] = ТаблицаНабораЗаписей[0][Колонка.Имя];
				КонецЦикла; 
			КонецЕсли; 
			
		КонецЕсли;
		
		МенеджерЗаписи.ЗначениеПоУмолчанию = Ложь;
		
	Иначе
		
		МенеджерЗаписи.Объект = ВыбОбъект;
		МенеджерЗаписи.Тип    = ВыбТип;
		МенеджерЗаписи.Вид    = ВыбВид;
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Объект = ВыбОбъект;
			МенеджерЗаписи.Тип    = ВыбТип;
			МенеджерЗаписи.Вид    = ВыбВид;
		КонецЕсли;
		
	КонецЕсли; 

	ФормаЗаписи = МенеджерЗаписи.ПолучитьФорму();
	ФормаЗаписи.ВладелецФормы = ФормаВладелец;
	ФормаЗаписи.ЗакрыватьПриВыборе = Ложь;
	ФормаЗаписи.Открыть();

КонецПроцедуры

// Процедура обрабатывает действие удаления
// записи контактной информации
//
// Параметры
//  ВыбОбъект - объект уже существующей записи в регистре контактной информации
//  ВыбТип - тип уже существующей или новой записи в регистре контактной информации
//  ВыбВид - вид уже существующей или новой записи в регистре контактной информации
// Возвращаемые значения
//  НЕТ
Процедура УдалитьЗапись(ВыбОбъект, ВыбТип, ВыбВид) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	
	Если НЕ ЗначениеЗаполнено(ВыбОбъект) Тогда
		// Выбрали запись, которой еще нет в регистре
		Возврат;
	Иначе
		МенеджерЗаписи.Объект = ВыбОбъект;
		МенеджерЗаписи.Тип    = ВыбТип;
		МенеджерЗаписи.Вид    = ВыбВид;
		МенеджерЗаписи.Прочитать();
	КонецЕсли; 

	Если МенеджерЗаписи.Выбран() Тогда
		ОтветНаВопрос = Вопрос("Удалить запись?", РежимДиалогаВопрос.ДаНет);
		Если ОтветНаВопрос  = КодВозвратаДиалога.Да Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
